### 행 인덱싱, 데이터 조작, 인덱스 조작
- loc()  : 라벨값 기반의 2차원 인덱싱, 배열 인덱싱은 불가능하다.
- iloc() : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [38]:
sampleDF = pd.DataFrame(np.arange(10, 22).reshape(3,4) , 
                        index = ['a', 'b', 'c'] , # 행 속성(이름) 부여
                        columns = ['col01', 'col02', 'col03', 'col04'] # 열 속성(이름) 부여
                       )

In [28]:
sampleDF

   col01  col02  col03  col04
a     10     11     12     13
b     14     15     16     17
c     18     19     20     21

- df.loc[행 인덱스]
- df.loc[행 인덱스 값 , 열 인덱스 값]

In [16]:
sampleDF.loc['a']

col1    10
col2    11
col3    12
col4    13
Name: a, dtype: int32

In [17]:
type( sampleDF.loc['a'])

pandas.core.series.Series

In [20]:
sampleDF.loc['a'].values

array([10, 11, 12, 13])

In [19]:
type( sampleDF.loc['a'].values)

numpy.ndarray

In [22]:
sampleDF.loc[['a', 'b']]

   col1  col2  col3  col4
a    10    11    12    13
b    14    15    16    17

In [24]:
sampleDF['col1']  # sampleDF.col1   ---> 두 가지 방법이 더 있는데 잘 안쓴다.

a    10
b    14
c    18
Name: col1, dtype: int32

In [29]:
sampleDF.loc[ sampleDF['col01'] > 15]

   col01  col02  col03  col04
c     18     19     20     21

In [30]:
type (sampleDF.loc[ sampleDF['col01'] > 15])

pandas.core.frame.DataFrame

In [31]:
type(sampleDF['col01'] > 15) # series 형태고 boolean masking이 되어있다.

pandas.core.series.Series

In [32]:
sampleDF['col01'] > 15 # boolean masking이 되어있고, 조건에 해당하는 것은 C 행 뿐이기 때문에 C행의 값들만 가져온다.

a    False
b    False
c     True
Name: col01, dtype: bool

In [39]:
sampleDF2 = pd.DataFrame(np.arange(10, 26).reshape(4,4) , 
                        columns = ['col01', 'col02', 'col03', 'col04'] # 열 속성(이름) 부여
                       )

In [40]:
sampleDF2

   col01  col02  col03  col04
0     10     11     12     13
1     14     15     16     17
2     18     19     20     21
3     22     23     24     25

In [41]:
sampleDF2.loc[1]

col01    14
col02    15
col03    16
col04    17
Name: 1, dtype: int32

In [42]:
sampleDF

   col01  col02  col03  col04
a     10     11     12     13
b     14     15     16     17
c     18     19     20     21

In [47]:
sampleDF.loc['a' , 'col01']

10

In [46]:
type( sampleDF.loc['a' , 'col01']) # 단일값 (스칼라 값)으로 출력이 된다.

numpy.int32

In [48]:
sampleDF.loc['b' : , 'col01']

b    14
c    18
Name: col01, dtype: int32

In [49]:
type( sampleDF.loc['b': , 'col01'])

pandas.core.series.Series

In [50]:
sampleDF.loc[ 'a' , :]

col01    10
col02    11
col03    12
col04    13
Name: a, dtype: int32

In [53]:
# 16, 17, 20, 21만 가져오고 싶다?
sampleDF.loc['b': , 'col03':]
sampleDF.loc['b':'c', ['col03', 'col04']]

   col03  col04
b     16     17
c     20     21

In [60]:
sampleDF.loc[ sampleDF['col04'] > 13, ['col03', 'col04']]

   col03  col04
b     16     17
c     20     21

In [61]:
sampleDF.loc[ sampleDF['col01'] > 10, ['col03', 'col04']]

   col03  col04
b     16     17
c     20     21

In [67]:
sampleDF.iloc[: , 0]

a    10
b    14
c    18
Name: col01, dtype: int32

In [74]:
#12, 13 값을 가져온다면?

sampleDF.iloc[0, 2:4]
sampleDF.iloc[0, -2:]

col03    12
col04    13
Name: a, dtype: int32

In [75]:
sampleDF.iloc[-1]

col01    18
col02    19
col03    20
col04    21
Name: c, dtype: int32

In [77]:
# 마지막 행 값들에 대해 제곱을 해주고 싶다면?

sampleDF.iloc[-1] = sampleDF.iloc[-1] * 2

sampleDF

   col01  col02  col03  col04
a     10     11     12     13
b     14     15     16     17
c     72     76     80     84

- 데이터 프레임 조작
- count

In [78]:
tmp_series = pd.Series(range(10))

In [80]:
tmp_series[5] = np.NaN

In [81]:
tmp_series

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    NaN
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [82]:
tmp_series.count() # 결측값을 제외한 데이터 갯수

9

In [90]:
cntDF = pd.DataFrame(np.random.randint(5, size=(4,4)))

In [91]:
cntDF

   0  1  2  3
0  1  4  1  0
1  1  0  1  2
2  1  2  4  0
3  4  3  0  2

In [85]:
cntDF.count() # 행에 대한 count를 하고 있다.

0    4
1    4
2    4
3    4
dtype: int64

In [92]:
cntDF.iloc[1,0] =np.NaN
cntDF.iloc[2,3] =np.NaN
cntDF.iloc[3,0] =np.NaN

In [93]:
cntDF

     0  1  2    3
0  1.0  4  1  0.0
1  NaN  0  1  2.0
2  1.0  2  4  NaN
3  NaN  3  0  2.0

In [95]:
cntDF.count() # 열을 기준으로 값 측정 4 3 3 3 이 아니라 2 4 4 3

0    2
1    4
2    4
3    3
dtype: int64

In [96]:
import seaborn as sns
datasets = sns.load_dataset('titanic', engine='python')

In [98]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [99]:
datasets.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [100]:
datasets.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [101]:
datasets.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [102]:
type( datasets['pclass'])

pandas.core.series.Series

- value_counts()

In [105]:
datasets['pclass'].value_counts() # value 값에 따른 count

pandas.core.series.Series

In [109]:
datasets['pclass'].value_counts().values

array([491, 216, 184], dtype=int64)

In [115]:
datasets['new_col'] = 0 # 새로운 칼럼 추가

In [112]:
datasets

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_col
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,0

In [116]:
del datasets['new_col'] # 칼럼 삭제

In [122]:
# age_by_10 컬럼 추가하고자 한다.
# age 컬럼의 값에 10살을 더한 값으로 일괄 적용한다
datasets['age_by_10'] = datasets['age'] + 10

In [124]:
datasets

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_by_10
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,32.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,48.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,36.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,45.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,45.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,37.0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,29.0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,36.0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,42.0

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age_by_10, Length: 891, dtype: float64